#+title: Ps 04
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-01-04>
#+lastmod: <2026-01-12 09:14>
#+options: num:t
#+startup: overview
#+latex: \newpage

*** code
#+begin_src julia :results output :export both :tangle julia/p_1.jl
using Symbolics

euler_cos(θ) = (exp(im*θ) + exp(-im*θ)) / 2
euler_sin(θ) = (exp(im*θ) - exp(-im*θ)) / (2im)

function validate(label, LHS, RHS)
    # symbolic difference
    diff = LHS - RHS

    sym_diff = simplify(diff)

    @variables x
    num_diff = substitute(sym_diff, Dict(x => 1.0))

    val = Symbolics.unwrap(num_diff)

    if abs(val) < 1e-12
        println(rpad(label, 30), " ✅ Q.E.D.")
    else
        println(rpad(label, 30), " ❌ Not proven. Diff ≈ $val")
    end
end

@variables x

println("--- PROOFS (Euler + Numerical Check) ---")
validate("cos(-x) = cos(x)",       euler_cos(-x), euler_cos(x))
validate("sin(-x) = -sin(x)",      euler_sin(-x), -euler_sin(x))
validate("cos(x) = sin(x + π/2)",  euler_cos(x),   euler_sin(x + pi/2))
validate("sin(x) = cos(x - π/2)",  euler_sin(x),   euler_cos(x - pi/2))
validate("sin(x + π) = -sin(x)",   euler_sin(x+pi), -euler_sin(x))
validate("cos(x + π) = -cos(x)",   euler_cos(x+pi), -euler_cos(x))
#+end_src

#+RESULTS:
#+begin_example
euler_cos (generic function with 1 method)
euler_sin (generic function with 1 method)
validate (generic function with 1 method)
1-element Vector{Num}:
 x
--- PROOFS (Euler + Numerical Check) ---
cos(-x) = cos(x)               ✅ Q.E.D.
sin(-x) = -sin(x)              ✅ Q.E.D.
cos(x) = sin(x + π/2)          ✅ Q.E.D.
sin(x) = cos(x - π/2)          ✅ Q.E.D.
sin(x + π) = -sin(x)           ✅ Q.E.D.
cos(x + π) = -cos(x)           ✅ Q.E.D.
#+end_example

*** Code
#+begin_src julia
import Pkg; Pkg.add("Symbolics")
#+end_src

#+RESULTS:
: nil

#+begin_src julia :results output :export both :tangle julia/p_2.jl
using Symbolics

@variables x
D = Differential(x)

expr = acos(x)

calculated_derivative = expand_derivatives(D(expr))

println("Function:   ", expr)
println("Derivative: ", calculated_derivative)

manual_formula = -1 / sqrt(1 - x^2)

difference = simplify(calculated_derivative - manual_formula)

if isequal(difference, 0)
    println("✅ Verification Successful.")
else
    println("❌ Verification Failed.")
end
#+end_src

#+RESULTS:
#+begin_example
1-element Vector{Num}:
 x
Differential(x)
acos(x)
-(1 / sqrt(1 - (x^2)))
Function:   acos(x)
Derivative: -(1 / sqrt(1 - (x^2)))
-1 / sqrt(1 - (x^2))
0
✅ Verification Successful.
#+end_example

*** Code
#+begin_src julia :results output :export both :tangle julia/p_6.jl
using Plots

const PATH = "./figs/"

# format: (function, derivative, range, title, name)
data = [
    (x -> sin(x^2),          x -> 2x * cos(x^2),                 -3:0.01:3,     "f(x) = sin(x^2)",     "fig_1"),
    (x -> exp(3x + 1),       x -> 3 * exp(3x + 1),               -1:0.01:0.5,   "g(x) = e^(3x+1)",     "fig_2"),
    (x -> log(5x^2 - x + 4), x -> (10x - 1) / (5x^2 - x + 4),    -3:0.01:3,     "f(x) = ln(5x^2-x+4)", "fig_3"),
    (x -> (2x^3 - x)^5,      x -> 5 * (2x^3 - x)^4 * (6x^2 - 1), -1.1:0.01:1.1, "g(x) = (2x^3-x)^5",   "fig_4"),
    (x -> sqrt(1 + exp(2x)), x -> exp(2x) / sqrt(1 + exp(2x)),   -2:0.01:2,     "f(x) = sqrt(1+e^2x)", "fig_5"),
    (x -> cos(log(x)),       x -> -sin(log(x)) / x,              0.2:0.01:6,    "g(x) = cos(ln x)",    "fig_6")
]

plots = map(data) do (f, df, r, t, n)
    p = plot(r, f, label="f(x)", linewidth=2, title=t, legend=:topleft)
    plot!(p, r, df, label="f'(x)", linewidth=2, title=t, linestyle=:dash)
    savefig(joinpath(PATH, n))
    p
end

final_plot = plot(plots..., layout=(3, 2), size=(1000, 1200), plot_title="Functions and Derivatives")
savefig(joinpath(PATH, "derivatives"))
#+end_src

#+RESULTS:
#+begin_example
"./figs/"
6-element Vector{Tuple{Function, Function, StepRangeLen{Float64, Base.TwicePrecision{Float64}, Base.TwicePrecision{Float64}, Int64}, String, String}}:
 (var"#1#13"(), var"#2#14"(), -3.0:0.01:3.0, "f(x) = sin(x^2)", "fig_1")
 (var"#3#15"(), var"#4#16"(), -1.0:0.01:0.5, "g(x) = e^(3x+1)", "fig_2")
 (var"#5#17"(), var"#6#18"(), -3.0:0.01:3.0, "f(x) = ln(5x^2-x+4)", "fig_3")
 (var"#7#19"(), var"#8#20"(), -1.1:0.01:1.1, "g(x) = (2x^3-x)^5", "fig_4")
 (var"#9#21"(), var"#10#22"(), -2.0:0.01:2.0, "f(x) = sqrt(1+e^2x)", "fig_5")
 (var"#11#23"(), var"#12#24"(), 0.2:0.01:6.0, "g(x) = cos(ln x)", "fig_6")
6-element Vector{Plots.Plot{Plots.GRBackend}}:
 Plot{Plots.GRBackend() n=2}
 Plot{Plots.GRBackend() n=2}
 Plot{Plots.GRBackend() n=2}
 Plot{Plots.GRBackend() n=2}
 Plot{Plots.GRBackend() n=2}
 Plot{Plots.GRBackend() n=2}
"/Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_04/figs/derivatives.png"
#+end_example

** Solution
#+begin_src julia :results output :export both :tangle julia/p_9.jl
using Plots

# ensure output directory exists
mkpath("./figs")

# define functions
f(x) = cos(x)
df(x) = -sin(x)
newton_step(x) = x - f(x) / df(x)

# shared settings
iterations = 5

# --- part 1: Newton's Method ---
x0 = 2.0
n_history = Float64[x0]

for i in 1:iterations
    current_x = last(n_history)
    next_x = newton_step(current_x)

    push!(n_history, next_x)
    println("Newton Iter $i: $next_x")
end

# --- part 2: Bisection Method ---
a, b = 0.0, 2.0
b_history = Float64[]

curr_a, curr_b = a, b

for i in 1:iterations
    global curr_a, curr_b

    c = (curr_a + curr_b) / 2
    push!(b_history, c)

    if f(c) * f(curr_a) < 0
        curr_b = c
    else
        curr_a = c
    end
    println("Bisection Iter $i: $c" )
end


# plotting
indices_n = 0:(length(n_history) - 1)
indices_b = 1:length(b_history)

plot(title="Convergence Comparison: Newton vs Bisection",
     xlabel="Iteration", ylabel="Value", legend=:topright)

# plot Newton
plot!(indices_n, n_history,
      label="Newton (x_n)",
      linewidth=2, marker=:circle, color=:blue)

# plot Bisection
plot!(indices_b, b_history,
      label="Bisection (midpoints)",
      linewidth=2, marker=:square, color=:green, linestyle=:dash)

# reference Line
hline!([pi/2], label="True Root (π/2)", color=:red, linestyle=:dot)

savefig("./figs/p_9")
#+end_src

#+RESULTS:
#+begin_example
"./figs"
f (generic function with 1 method)
df (generic function with 1 method)
newton_step (generic function with 1 method)
5
2.0
1-element Vector{Float64}:
 2.0
Newton Iter 1: 1.5423424456397141
Newton Iter 2: 1.5708040082580965
Newton Iter 3: 1.5707963267948966
Newton Iter 4: 1.5707963267948966
Newton Iter 5: 1.5707963267948966
(0.0, 2.0)
Float64[]
(0.0, 2.0)
Bisection Iter 1: 1.0
Bisection Iter 2: 1.5
Bisection Iter 3: 1.75
Bisection Iter 4: 1.625
Bisection Iter 5: 1.5625
0:5
1:5
"/Users/ziro2173/personal/university/01_bachelor/2025_winter_term/01_analysis/02_exercises/set_04/figs/p_9.png"
#+end_example
